---
kind: property
id: P:Autodesk.Revit.DB.HostedSweep.VerticalOffset
source: html/8b3de2d4-3005-afc9-cbc5-1862fd60341e.htm
---
# Autodesk.Revit.DB.HostedSweep.VerticalOffset Property

Retrieve/set the vertical offset of the hosted sweep object.

## Syntax (C#)
```csharp
public double VerticalOffset { get; set; }
```